Repository: devmohamedwahba/Forms-Project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Arabic
ar: العربية

source: English
ar: الانجليزية

source: Active
ar: فعال

source: Inactive
ar: غير فعال

source: OnRemote
ar: عن بعد

source: Break time duration cannot exceed shift duration.
ar: لا يمكن أن تتجاوز مدة الاستراحة مدة المناوبة.

source: Break time duration cannot be negative.
ar: لا يمكن أن تكون مدة الاستراحة سالبة.

source: Present
ar: حاضر

source: Absent
ar: غياب

source: You are not an active user
ar: أنت لست مستخدمًا نشطًا

source: Invalid username or password
ar: اسم مستخدم أو كلمة مرور غير صالحة

source: You don't have permission to create employees.
ar: ليس لديك إذن لإنشاء الموظفين.

source: Employee created successfully.
ar: تم إنشاء الموظف بنجاح.

source: Failed to create employee. User does not exist.
ar: فشل إنشاء الموظف. المستخدم غير موجود.

source: Failed to create employee. Work location does not exist.
ar: فشل إنشاء الموظف. موقع العمل غير موجود.

source: Failed to create employee:
ar: فشل إنشاء الموظف:

source: You don't have permission to view employees.
ar: ليس لديك إذن لعرض الموظفين.

source: You don't have permission to change employees.
ar: ليس لديك إذن لتغيير الموظفين.

source: Employee updated successfully.
ar: تم تحديث الموظف بنجاح.

source: User does not exist.
ar: المستخدم غير موجود.

source: Work location does not exist.
ar: موقع العمل غير موجود.

source: Failed to update employee:
ar: فشل تحديث الموظف:

source: You don't have permission to delete employees.
ar: ليس لديك إذن لحذف الموظفين.

source: You don't have permission to Create Shift.
ar: ليس لديك إذن لإنشاء الورديات.

source: Shift created successfully.
ar: تم إنشاء الوردية بنجاح.

source: Failed to create Shift:
ar: فشل إنشاء الوردية:

source: Actions created successfully.
ar: تم إنشاء الإجراءات بنجاح.

source: Failed to create Actions:
ar: فشل إنشاء الإجراءات:

source: You don't have permission to Update Actions.
ar: ليس لديك إذن لتحديث الإجراءات.

source: Actions updated successfully.
ar: تم تحديث الإجراءات بنجاح.

source: Actions does not exist.
ar: الإجراءات غير موجودة.

source: Failed to update Actions:
ar: فشل تحديث الإجراءات:

source: You don't have permission to delete action.
ar: ليس لديك إذن لحذف الإجراء.

source: Shift updated successfully.
ar: تم تحديث الورديات بنجاح.

source: Shift does not exist.
ar: غير موجودة.

source: Failed to update Shift:
ar: فشل تحديث الورديات:

source: You don't have permission to Create Vehicle.
ar: ليس لديك إذن لإنشاء المركبة.

source: Vehicle created successfully.
ar: تم إنشاء السيارة بنجاح.

source: Failed to create Vehicle:
ar: فشل إنشاء السيارة:

source: Vehicle updated successfully.
ar: تم تحديث السيارة بنجاح.

source: Vehicle does not exist.
ar: السيارة غير موجودة.

source: Failed to update Vehicle:
ar: فشل تحديث السيارة:

source: You don't have permission to Create Vehicle Type.
ar: ليس لديك إذن لإنشاء نوع المركبة.

source: Vehicle Type created successfully.
ar: تم إنشاء نوع المركبة بنجاح.

source: Failed to create Vehicle Type:
ar: فشل إنشاء نوع المركبة:

source: You don't have permission to Update Vehicle Type.
ar: ليس لديك إذن لتحديث نوع المركبة.

source: VehicleType updated successfully.
ar: تم تحديث نوع المركبة بنجاح.

source: VehicleType does not exist.
ar: نوع المركبة غير موجود.

source: Failed to update VehicleType:
ar: فشل تحديث نوع المركبة:

source: You don't have permission to delete Vehicle Type.
ar: ليس لديك إذن لحذف نوع المركبة.

source: Employee does not exist. Please create an employee first.
ar: الموظف غير موجود. يرجى إنشاء موظف أولاً.

source: Group does not exist. Please create a group first.
ar: المجموعة غير موجودة. يرجى إنشاء مجموعة أولاً.

source: Routine does not exist. Please assign a routine to the employee first.
ar: الروتين غير موجود. يرجى تعيين روتين للموظف أولاً.

source: Employee does not exist. Please create an employee profile first.
ar: الموظف غير موجود. يرجى إنشاء ملف تعريف الموظف أولاً.

source: No duty assigned to the employee. Please assign a duty first.
ar: لا توجد واجبات مخصصة للموظف. يرجى تعيين واجب أولاً.

source: You don't have permission to Create Company Attendance.
ar: ليس لديك إذن لإنشاء حضور الشركة.

source: You don't have permission to Create Vehicle Failures.
ar: ليس لديك إذن لإنشاء أعطال المركبات.

source: You don't have permission to Create Company.
ar: ليس لديك إذن لإنشاء الشركة.

source: Company created successfully.
ar: تم إنشاء الشركة بنجاح.

source: Failed to create Company: %(error)s
ar: فشل في إنشاء الشركة: %(error)s

source: You don't have permission to Update Company.
ar: ليس لديك إذن لتحديث الشركة.

source: You don't have permission to delete Company.
ar: ليس لديك إذن لحذف الشركة.

source: You don't have permission to create Routines.
ar: ليس لديك إذن لإنشاء الروتينات.

source: Routine with this shift already exists.
ar: الروتين مع هذا النوب موجود بالفعل.

source: Routine created successfully.
ar: تم إنشاء الروتين بنجاح.

source: Failed to create routine: {}
ar: فشل في إنشاء الروتين: {}

source: You don't have permission to View Routines.
ar: ليس لديك إذن لعرض الروتينات.

source: Routine Updated successfully.
ar: تم تحديث الروتين بنجاح.

source: Failed to update routine: {str(e)}
ar: فشل تحديث الروتين: {str(e)}

source: You don't have permission to create Roles.
ar: ليس لديك إذن لإنشاء الأدوار.

source: Invalid group or user ID
ar: معرف مجموعة أو مستخدم غير صالح

source: You don't have permission to create Employee Routines.
ar: ليس لديك الإذن لإنشاء روتين الموظفين.

source: Employee routine assigned successfully.
ar: تم تعيين روتين الموظف بنجاح.

source: Employee does not exist.
ar: الموظف غير موجود.

source: Routine does not exist.
ar: الروتين غير موجود.

source: Failed to assign employee routine: {str(e)}
ar: فشل في تعيين روتين الموظف: {str(e)}

source: You don't have permission to create Employee Duty.
ar: ليس لديك الإذن لإنشاء واجب الموظف.

source: Duty assigned successfully.
ar: تم تعيين الواجب بنجاح.

source: New Duty Assigned to You
ar: واجب جديد مخصص لك

source: Failed to assign duty: {str(e)}
ar: فشل في تعيين الواجب: {str(e)}

source: You don't have permission to create Clients.
ar: ليس لديك إذن لإنشاء عملاء.

source: Client created successfully.
ar: تم إنشاء العميل بنجاح.

source: Invalid value provided: {error}
ar: القيمة المقدمة غير صالحة: {error}

source: You don't have permission to view Clients.
ar: ليس لديك إذن لعرض العملاء.

source: Failed to update client: {str(e)}
ar: فشل تحديث العميل: {str(e)}

source: You don't have permission to Create Users.
ar: ليس لديك إذن لإنشاء المستخدمين.

source: Passwords do not match.
ar: كلمات المرور غير متطابقة.

source: This email address is already in use.
ar: عنوان البريد الإلكتروني هذا مستخدم بالفعل.

source: User Created Successfully!
ar: تم إنشاء المستخدم بنجاح!

source: User Updated Successfully!
ar: تم تحديث المستخدم بنجاح!

source: You don't have permission to View Users.
ar: ليس لديك إذن لعرض المستخدمين.

source: You don't have permission to Check Attendance.
ar: ليس لديك إذن للتحقق من الحضور.

source: You don't have permission to Create Request Form.
ar: ليس لديك إذن لإنشاء نموذج طلب.

source: You don't have permission to View Request Form.
ar: ليس لديك إذن لعرض نموذج الطلب.

source: You don't have permission to View Attachment Form.
ar: ليس لديك إذن لعرض نموذج المرفقات.

source: New Request Notifications
ar: إشعارات الطلبات الجديدة

source: Request Forbidden
ar: الطلب ممنوع

source: You Don't have permission to perform this action
ar: ليس لديك الإذن بتنفيذ هذا الإجراء

source: Go Back
ar: عُد

source: List All
ar: عرض الكل

source: ID
ar: المعرف

source: Name
ar: الاسم

source: Clients
ar: المخولين

source: Job Grade
ar: الدرجة الوظيفية

source: Job Role
ar: الدور الوظيفي

source: Head Office
ar: الادارة

source: Headquarter Name
ar: اسم الادارة العامة

source: Mobile
ar: الموبايل

source: UID
ar: المعرف المميز

source: Email
ar: البريد الالكتروني

source: Company
ar: الشركة

source: Attendance
ar: الحضور

source: Employees
ar: الموظفين

source: Duty
ar: الوظيفة

source: City
ar: المدينة

source: Plate
ar: اللوحة

source: Number
ar: رقم اللوحة

source: Type
ar: نوع اللوحة

source: Milage
ar: عداد الاميال

source: Start
ar: استلام العداد

source: KM
ar: كيلومتر

source: Finish
ar: تسليم العداد

source: Spend
ar: الاستخدام

source: Cases
ar: القضايا

source: Reports
ar: التقارير

source: Date of Case
ar: تاريخ القضية

source: Zone
ar: المنطقة

source: Type of Case
ar: نوع القضية

source: Case
ar: قضية

source: Description
ar: وصف

source: Summart
ar: ملخص

source: Guard
ar: الحارس

source: Nationality
ar: جنسية الحارس

source: Comments
ar: الملاحظات

source: Username
ar: اسم المستخدم

source: Work Locations
ar: مواقع العمل

source: Routine
ar: نظام العمل

source: Shift
ar: المناوبة

source: Start Time
ar: وقت البداية

source: Break Duration
ar: مدة الاستراحة

source: End Time
ar: وقت النهاية

source: Users
ar: المستخدمين

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: Mobile Number
ar: رقم الهاتف المحمول

source: Groups
ar: المجموعات

source: Vehicle
ar: المركبة

source: Failures
ar: الاعطال

source: Details
ar: التفاصيل

source: Year
ar: سنة

source: Source
ar: مصدر اللوحة

source: Month
ar: شهر

source: Checked In
ar: حضور

source: Checked Out
ar: انصراف

source: All Employees Monthly Attendance
ar: الحضور الشهري لجميع الموظفين

source: Today Attendance
ar: الحضور اليومي

source: Attendance Sheet
ar: ورقة الحضور

source: Break
ar: استراحة

source: Total
ar: المجموع

source: Status
ar: الحالة

source: Task and Management System
ar: نظام المهام والإدارة

source: Loading
ar: الانتظار

source: Dashboard
ar: لوحة التحكم

source: Create
ar: انشاء

source: Management
ar: الادارة

source: Assign
ar: تعيين

source: Authorized
ar: مخول

source: Requests
ar: الطلبات

source: Cases Log
ar: سجل القضايا

source: Trafic Log
ar: سجل المرور

source: Attachment
ar: المرفق

source: Logout
ar: تسجيل خروج

source: Request is required
ar: الطلب مطلوب

source: Search
ar: البحث

source: Attach Images
ar: إرفاق الصور

source: Save
ar: حفظ

source: Confirmation Message
ar: رسالة تأكيد

source: Are You Sure Want to Submit this?
ar: هل أنت متأكد من أنك تريد الارسال

source: Close
ar: اغلاق

source: Password
ar: كلمة المرور

source: Address
ar: العنوان

source: Client Report
ar: تقرير العميل

source: Created
ar: تم الانشاء

source: No Requests
ar: لايوجد طلبات

source: City
ar: المدينة

source: Employee Routine
ar: نظام عمل الموظف

source: Call
ar: الاتصال

source: Company Attendance created successfully
ar: تم إنشاء حضور الشركة بنجاح

source: Zone
ar: المنطقة

source: Security
ar: الحماية

source: Traffic
ar: السجل المروري

source: Maintainance
ar: الصيانة

source: Security Info
ar: معلومة أمنية

source: Other
ar: آخر

source: Company Cases created successfully
ar: تم إنشاء حالات الشركة بنجاح

source: Employee is required
ar: مطلوب موظف

source: Worklocation is required
ar: مطلوب مكان العمل

source: First name can only contain letters and spaces.
ar: يمكن أن يحتوي الاسم الأول على أحرف ومسافات فقط.

source: Last name can only contain letters and spaces.
ar: يمكن أن يحتوي الاسم الأخير على أحرف ومسافات فقط

source: Username can only contain numbers, letters and spaces.
ar: يمكن أن يحتوي اسم المستخدم على أرقام وحروف ومسافات فقط.

source: Confirm Password
ar: تأكيد كلمة المرور

source: Is Employee?
ar: هل موظف؟

source: Accident
ar: حادث

source: Failure
ar: عطل

source: Vehicle Failure created successfully
ar: تم إنشاء فشل المركبة بنجاح

source: Name can only contain letters and spaces.
ar: يمكن أن يحتوي الاسم على أحرف ومسافات فقط

source: Main Headquarter
ar: الادارة العامة

source: Birth Date
ar: تاريخ الميلاد

source: Designation Date
ar: تاريخ التعيين

source: ID Number
ar: رقم الهوية

source: Shift is required
ar: التحول مطلوب

source: Break duration cannot be more than the difference between start time and end time.
ar: لا يمكن أن تكون مدة الاستراحة أكثر من الفرق بين وقت البدء ووقت الانتهاء.

source: Welcome Back
ar: مرحبًا بعودتك

source: Our
ar: ملكنا

source: View All
ar: عرض الكل

source: Employee Duty
ar: واجب الموظف

source: Title
ar: العنوان

source: Routine is required
ar: الروتين مطلوب

source: Attachment Form
ar: نموذج الصور

source: Added By
ar: تمت إضافته بواسطة

source: File
ar: الملف

source: Request Note
ar: طلب ملاحظة

source: Request Method
ar: طريقة الطلب

source: Request Reason
ar: سبب الطلب

source: Request Date
ar: تاريخ الطلب

source: Request Time
ar: وقت الطلب

source: New Notifications
ar: إشعارات جديدة

source: ago
ar: منذ

source: Unread
ar: غير مقروءة

source: Mark as Read
ar: ضع إشارة مقروء

source: All Notifications
ar: جميع الإخطارات

source: Person ID
ar: الرقم الموحد

source: Request Form
ar: نموذج طلب

source: Information Form
ar: استمارة المعلومات

source: Request Priority
ar: أولوية الطلب

source: True
ar: نعم

source: False
ar: لا

source: Departments
ar: الأقسام

source: Corresponding
ar: المراسلات

source: Request created successfully
ar: تم إنشاء الطلب بنجاح

source: Request Report
ar: طلب تقرير

source: Sign-in
ar: تسجيل الدخول

source: Your place to work
ar: مكان عملك

source: Plan
ar: التخطيط

source: Control
ar: التحكم

source: Are You Sure Want to Delete this?
ar: هل تريد بالتأكيد حذف هذا؟

source: Date
ar: التاريخ

source: Calculations
ar: العمليات الحسابية

source: Update
ar: تحديث

source: Company Attendance updated successfully
ar: تم تحديث حضور الشركة بنجاح

source: Company Cases updated successfully
ar: تم تحديث حالات الشركة بنجاح

source: Request updated successfully
ar: تم تحديث الطلب بنجاح

source: Note
ar: ملاحظة

source: Vehicle Failure updated successfully
ar: تم تحديث فشل المركبة بنجاح

source: Role
ar: الدور

source: Role Permission
ar: صلاحيات الدور

source: User Permission
ar: صلاحيات المستخدم

source: Role is required
ar: الدور مطلوب

source: Available Permissions
ar: الصلاحيات المتاحة

source: Double Click to Add Permissions
ar: انقر نقرًا مزدوجًا لإضافة الصلاحيات

source: Chosen Permissions
ar: الصلاحيات المختارة

source: Double Click to Remove Permissions
ar: انقر نقرًا مزدوجًا لإزالة الصلاحيات

source: User is required
ar: مطلوب المستخدم
